backend: "python"

input [
  {
    name: "user_ids"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  },
  {
    name: "item_ids"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  },
  {
    name: "items_to_recommend"
    data_type: TYPE_STRING
    dims: [ -1 ]
    optional: true
  },
  {
    name: "top_n"
    data_type: TYPE_INT32
    dims: [ 1 ]
  },
  {
    name: "filter_viewed"
    data_type: TYPE_BOOL
    dims: [ 1 ]
  }
]


output [
  {
    name: "item_ids"
    data_type: TYPE_STRING
    dims: [ -1 ]
  },
  {
    name: "scores"
    data_type: TYPE_FP32
    dims: [ -1 ]
  },
  {
    name: "strategy"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

dynamic_batching {
  default_queue_policy {
    default_timeout_microseconds: 5000000
  }
}

instance_group [{ kind: KIND_CPU }]
name: "model_group"