"""
Author: Ruide Cao (caoruide123@gmail.com)
Date: 2024-12-25 21:20:44
LastEditTime: 2024-12-25 22:05:50
FilePath: \\sagkit\\src\\sagkit\\haha.py
Description: 
Copyright (c) 2024 by Ruide Cao, All Rights Reserved. 
"""

print("亲爱的张昱琪：")
print("我爱你！")
print("我们在一起已经有3年了（刚刚开始第3年）。")
print("前年的圣诞节，我们在KTV一起唱歌，那是我们第一次一起过圣诞节。")
print("我记得那时你很开心，我也很开心。")
print("我很喜欢你开心的样子，我也很喜欢你。")
print("我们唱完歌回来就生病了，我很担心你，但是你很坚强。")
print("那时候我给你写了情书，你给我送了止痛药。")
print("然后你没有犹豫，就答应了我。")
print("去年的圣诞节，我们在万象天地玩游戏，那是我们第二次一起过圣诞节。")
print("我记得那时你因为我陪你太少了，所以有点生气。")
print("我跟你出去玩的时候老是很呆滞，也不知道怎么逗你开心。")
print("你讨厌呆滞的我，觉得跟我心思不在你身上。")
print("我知道我很呆滞，但是我会对你好的。")
print("那天玩游戏我靠锤那个按钮给你赚了一些硬币。")
print("今年的圣诞节，我们相隔两地，这是我们第三次过圣诞节。")
print("今年我们不能一起过圣诞节，我很难过。")
print("我的房间能看到新加坡繁华的街道，我看见人们在街上走来走去。")
print("我看见他们手里拿着收到或送出的礼物。")
print("我看见他们包裹在节日的欢乐和幸福里。")
print("在遥远的夜里，我很想你。")
print("2024年12月25日")
print("哈哈")
