"""KBD calculation methods."""


class MethodsKBD:
    """Codes for methods of KBD calculation."""

    STO173 = '6907365'  # СТО Газпром 2-2.3-173
    ASME2012 = '6907367'  # ASME B31G-2012
    GAZNADZOR2013 = '6907370'  # «Инструкция по оценке дефектов труб...» ООО Газнадзор, 2013
    VRD = '6907372'  # ВРД 39-1.10-004-99
    NGKS = '60000213471'  # ЗАО "Нефтегазкомплектсервис"
    GAZNADZOR2008 = '990005096276'  # «Инструкция по оценке дефектов труб...» ООО Газнадзор, 2006/2008
    API579 = '4982902'  # API 579 Трещины, Уровень2
    STO112 = '990005096286'  # СТО Газпром 2-2.3-112
    BS7910 = '990005096288'  # BS 7910:2005
    ASME = '990005096289'  # ASME B31G-1991
    ASMEB31G = '990005096290'  # Модифицированный ASME B31G, 1993
    DNV = '990005096506'  # DNV-RP-F101-2004
