"""Inspection tool types."""


class PigType:
    """Codes for pig types."""

    COMMON = '1934099'  # Дефектоскоп
    TFI = '990004033563'  # Дефектоскоп магнитный поперечного намагничивания
    MFL = '990005096296'  # Дефектоскоп магнитный продольного намагничивания
    INTRO = '10525034'  # Интроскоп
    COMPLEX = '990004033564'  # Комплекс
    MAGN_CLEAN = '11843188'  # Магнитный очистной
    CALIPER_MAGN = '990004033558'  # Магнитный профилемер
    CLEANER = '990004033560'  # Очистной скребок
    TOPOGRAPH = '6907295'  # Поршень навигационно-топографический
    NAVIGATE = '990004033566'  # Поршень-дефектоскоп (навигационно-топографический)
    CALIPER_TOOL = '990004033562'  # Поршень-шаблон
    CALIPER_VTD = '9716245'  # Профилемер внутритрубный механический
    CALIPER_MECH = '990004033561'  # Рычажный (профилемер)
    ULTRASONIC = '990004033557'  # Ультразвуковой дефектоскоп
    EXPERIMENTAL = '990004033565'  # Экспериментальный
    # EMAP = '6907298'
    # COMBO = '6915601'
